package com.goodsure.john.utils;

/**
 * Author: John
 * E-mail：634930172@qq.com
 * Date: 2018/3/1 14:59
 * Description:基础配置类
 */

public class BaseConfig {
    /**
     * app_secret
     */
    public static final String BASE_URL = "https://www.mrallen.cn/api/";

    /** SP文件名 */
    public static final  String    SP_NAME           = "basic_params";


    public static final String WEB_DATA="\"<!--IMG#0--><p>　　本文的作者是NBA最具权威的薪金大师拉里-库恩，他的“CBA FAQ”网站在联盟内广为流传，NBA众多球的总经理和制服组都向他请教劳资条款事宜。</p><p>　　灰熊队的当家控卫康利现在拿的是NBA历史上最大的合同。</p><p>　　但这很可能长不了。</p><p>　　谁会是下一个戴上“收入最高球员”桂冠的人呢？谁又会签下NBA史上第一份两亿大合同？我们对此提出了9位候选人，其中有4位球员的可能性最大。</p><p>　　怎么才能成为幸运儿？</p><p>　　要拿联盟史上最大合同，天时地利缺一不可——你要在巅峰时期或接近巅峰时期成为自由球员，同时规则要对你有利，你的贡献能证明你配得上这么高的薪水。但即便这些条件都符合，要拿最大的合同还是需要满足一些特殊情况。</p><p>　　今年的康利可谓万事顺遂，他是灰熊队2007年用四号签选中的球员，整个职业生涯都在同一支球队打球。到28岁时，他在正确的年龄成为了自由球员，满足了可以签下五年合同的条件，而且他是在2016年进入自由球员市场的，这正是联盟历史最大的一次卖方市场。</p><p>　　为什么是现在？</p><p>　　你可能已经知道，NBA和电视台签下的新转播合同今年生效，这就意味着联盟从其主要收入来源之一拿到的钱多了一倍。由于联盟的收入中有一半左右是确保要用在球员身上的，因此这笔增加的收入就直接体现在了2016年的自由球员市场上——包括康利。</p><p>　　NBA的工资帽从7,000万提升到了超过9,400万，增幅超过34%，这样的增幅前所未有。薪金上限也同样有大幅度的提升，像康利这样在联盟中打了7—9年的球员有资格签下第一年起薪最高达到2,650万的合同（而上赛季这一数字还是1,970万）。</p><p>　　联盟中有超过三分之二的球队都有条件清出足够的薪金空间来追逐康利。这让灰熊队做决定时根本无需动脑，他们给了康利他们所能提供的最高起薪（26,540,100美元）、最长合同年限（五年）和最大的加薪幅度（每年7.5%）。</p><p>　　接下来会怎样？</p><p>　　康利总价值达到152,605,575美元的合同可能是难以想象的，但他这份NBA史上最大合同的地位并不会维持太长时间。</p><p>　　NBA球龄超过10年的球员的薪金上限会更高，等到有合适的球员在合适的时间成为自由球员时，他的合同总价值应该就会超过康利。</p><p>　　这需要合适的环境——某位球员的NBA球龄至少达到10年，年龄不超过31岁（否则就会触发36岁条款，对他的薪金数额有所限制），并利用完全伯德权与之前效力的球队重签合同（允许签订五年合同，每年加薪幅度为7.5%）。有几位球员即将完全符合这些条件。</p><!--IMG#1--><p>　　谁是下一个？</p><p>　　有四位球员的合同最有可能超越康利：</p><!--IMG#2--><p>　　<strong>拉塞尔-威斯布鲁克</strong></p><p>　　雷霆刚刚和球队留下来的头牌完成了“重新谈判并延长合同”的工作，将威斯布鲁克2016-17赛季的薪金提高到了2650万，同时将合同延长到了2018-19赛季，最后一个赛季有球员选项，这就意味着威斯布鲁克可以选择在2018年或是2019年成为自由球员。</p><p>　　如果他在2018年成为自由球员，他会是29岁，很可能依旧处在巅峰，而在联盟中正好打满了10年。如果他选择与雷霆队重新签约，他的合同起薪预计可以达到3,550万美元，总额则可以达到2亿410万美元。</p><p>　　如果他等到2019年再成为自由球员，那么他的合同起薪预计可以达到3,580万美元，总额则可能接近2亿600万美元。</p><!--IMG#3--><p>　　<strong>詹姆斯-哈登</strong></p><p>　　哈登现在的合同签到了2020年，有球员选项，这样他可以在2019年成为自由球员。（和威斯布鲁克一样，哈登也是最近重新谈判，延长了合同。）</p><p>　　如果他在2019年成为自由球员，并和火箭重签合同，他将年满30岁，和威斯布鲁克一样可以拿到3,580万的起薪和2亿600万美元的合同总额。</p><p>　　如果他等到2020年再成为自由球员，他的起薪预计可以达到3,750万美元，合同总额达到2亿1,560万美元。</p><!--IMG#4--><p>　　<strong>迪安德雷-乔丹</strong></p><p>　　洛杉矶快船队中锋目前的合同是到2019年，有球员选项，这样他可以选择在2018年成为自由球员，到时候他将年满30岁，在联盟中打满10年，和威斯布鲁克一样可以拿到3,550万的起薪和2亿410万美元的合同总额。</p><p>　　如果他等到2019年再成为自由球员，他的合同也可以和威斯布鲁克起薪3,580万、总额2亿600万美元的合同相当。但考虑到快船的建队时间表并不确定，可以说威斯布鲁克和哈登都比小乔丹更有可能签下2亿美元的合同。等小乔丹成为自由球员时，保罗和格里芬都有可能已经不在队中了；或者快船队决定改变建队方向，鲍尔默不打算在小乔丹身上进行巨额投资；或者小乔丹不打算忍受一支最终陷入重建的快船队，决定到其他地方打球。这些都是有可能发生的。</p><p>　　不过有一点是明确的：对小乔丹来说，薪金和罚球不挂钩实在是件好事。</p><!--IMG#5--><p>　　<strong>凯尔-洛瑞</strong></p><p>　　如果猛龙队的控球后卫执行球员选项，在2017年成为自由球员的话，他到时候将年满31岁，NBA球龄为11年，这样他有资格得到预计起薪最高达到3,350万、总额为1亿9,600万的五年合同。如果他不执行球员选项，到2018年才成为自由球员的话，他就将年满32岁了，这意味着他会受到限制，只能签下四年合同。但洛瑞的话，大家就会怀疑2017年和他签顶薪合同是不是合理。他上赛季打出了职业生涯代表作级的表现，必须保持类似的水平，才有机会签到这份顶薪合同。</p><p>　　即便猛龙队和洛瑞达成一份起薪稍低的合同，他的下一份合同也依旧有可能超越康利的合同总额，不过洛瑞就没机会跨过有魔力的两亿大关了。但是，洛瑞依旧有可能是下一个签下“NBA史上最大合同”的球员，虽然他的统治也会是短暂的，威斯布鲁克、哈登或是小乔丹都会很快再超越他。</p><p>　　排在他们之后的球员</p><p>　　还有五名球员在下次成为自由球员时都有可能跨过两亿合同的大关。</p><p>　　<strong>布鲁克-洛佩斯（2018年，30岁）</strong></p><p>　　<strong>凯文-乐福（2019年或2020年；30岁或31岁）</strong></p><p>　　<strong>尼古拉斯-巴图姆（2020年，31岁）</strong></p><p>　　<strong>埃文-特纳（2020年，31岁）</strong></p><p>　　<strong>德玛尔-德罗赞（2020年或2021年；30岁或31岁）</strong></p><p>　　但目前的情况是，这几位球员在成为自由球员时都不太可能拿到顶薪合同。实际上，在球龄超过10年的球员里，很少有人能得到为期超过三年、起薪达到或超过老将顶薪的新合同或提前续约合同。1999年至今，只有卡尔-马龙（1999年），克里斯-波什（2014年）和卡梅罗-安东尼（2014年）收到了这样的合同——此外，穆托姆博（2001年）和奥尼尔（2005年）的合同与之接近。</p><p>　　所以，能收到最大可能合同的球员是经过精挑细选的，这就意味着在未来几年里，除了威斯布鲁克、哈登，或许还有小乔丹之外，其他球员不大可能签下一份这样的合同。不过，这三位球员当中应该至少会有一位超越康利的纪录，并成为NBA的第一个两亿先生。</p><p>　　（OnFire，天朝最diao的篮球APP）</p>\"";

}
